In [1]:
"""
@Title: 
@Author(s): Stephen CUI
@LastEditor(s): Stephen CUI
@CreatedTime: 2023-11-19 13:52:32
@Description: 
"""

'\n@Title: \n@Author(s): Stephen CUI\n@LastEditor(s): Stephen CUI\n@CreatedTime: 2023-11-19 13:52:32\n@Description: \n'

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('../data/jj.csv')
df.head()

         date  data
0  1960-01-01  0.71
1  1960-04-01  0.63
2  1960-07-02  0.85
3  1960-10-01  0.44
4  1961-01-01  0.61

In [4]:
df.tail()

          date   data
79  1979-10-01   9.99
80  1980-01-01  16.20
81  1980-04-01  14.67
82  1980-07-02  16.02
83  1980-10-01  11.61

In [5]:
train = df[:-4]
test = df[-4:]